cs428.org
* Chapter 1: Overview
** The CIA Triad
- Confidentiality
  - Preserving intended restrictions on information access
- Integrity
  - Guarding against improper information modification or destruction
- Availability
  - Ensuring timely and reliable access to information
** Additional Security Concepts
- Authenticity
- Accountability
** Challenges
- Only one vulnerability needs to be found by attacker,
  defender must patch all vulnerabilities
** Categories of Vulnerabilities
- Corrupted (loss of integrity)
- Leaky (loss of confidentiality)
- Unavailable (loss of availability)
** Categories of Attacks
- Passive
  - attempt to learn or make use of information from the system that does not affect system resources
- Active
  - attempt to alter system resources or affect their operation
- Insider
  - initiated by an entity within the security perimeter
- Outsider
  - initiated by an entity outside of the security perimeter
** Security Functional Requirements
- Security technical measures
  - required to deal with access control problems
  - identification and authentication
  - system and communication protection
  - system and information integrity
- Management controls and procedures
  - awareness and training
  - audit and accountability
  - certification, acreditation and security assessments
* Chapter 2: Cryptographic Tools
** Cryptography vs. Security
- Theory vs Practice
- Tools vs. Applications
- etc
** Symmetric Encryption
- Also referred to as conventional encryption or single-key encryption
*** Two requirements for secure use:
- Strong encryption algorithm
- Sender and receiver must have obtained copies of the secret key in a secure fashion
** Attacking Symmetric Encryption
- Broadly divided into cryptanalytic and brute-force attacks
- Crypt analytic exploits weaknesses in the algorithm
- A more critical possibility:
  - Stealing the keys from memory or disk
** Table 2.1
|                              | DES | Triple DES |              AES |
|------------------------------+-----+------------+------------------|
| Plaintext block size (bits)  |  64 |         64 |              128 |
| Ciphertext block size (bits) |  64 |         64 |              128 |
| Key size (bits)              |  56 | 112 or 168 | 128, 192, or 256 |
|------------------------------+-----+------------+------------------|
