cs428.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-05 Thu 20:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ethan" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc674d36">1. Chapter 1: Overview</a>
<ul>
<li><a href="#org4ff91f0">1.1. The CIA Triad</a></li>
<li><a href="#org9036d79">1.2. Additional Security Concepts</a></li>
<li><a href="#org4a59542">1.3. Challenges</a></li>
<li><a href="#org88ed95b">1.4. Categories of Vulnerabilities</a></li>
<li><a href="#orgb4ea010">1.5. Categories of Attacks</a></li>
<li><a href="#orge52769e">1.6. Security Functional Requirements</a></li>
</ul>
</li>
<li><a href="#org4f49ac6">2. Chapter 2: Cryptographic Tools</a>
<ul>
<li><a href="#org6035dfc">2.1. Cryptography vs. Security</a></li>
<li><a href="#org043d404">2.2. Symmetric Encryption</a>
<ul>
<li><a href="#orgfbe8e13">2.2.1. Two requirements for secure use:</a></li>
</ul>
</li>
<li><a href="#org56531c2">2.3. Attacking Symmetric Encryption</a></li>
<li><a href="#org6e441ff">2.4. Table 2.1</a></li>
<li><a href="#org7153eb2">2.5. Data Encryption Standard (DES)</a>
<ul>
<li><a href="#org20c9894">2.5.1. Triple DES (3DES)</a></li>
</ul>
</li>
<li><a href="#org86abeff">2.6. Advanced Encryption Standard (AES)</a></li>
<li><a href="#org17e744b">2.7. Practical Security Issues</a></li>
<li><a href="#org601f782">2.8. Block Ciphers</a></li>
<li><a href="#orge24f206">2.9. Stream Ciphers</a></li>
<li><a href="#orgcb8969f">2.10. Public-Key Encryption Structure</a></li>
<li><a href="#org7207b5e">2.11. RSA</a></li>
<li><a href="#org63c0ff4">2.12. Requirements for Public-Key Cryptosystems</a></li>
<li><a href="#orgc73e6ce">2.13. Asymmetric Encryption Algorithms</a></li>
<li><a href="#org69f929e">2.14. Table 2.3</a></li>
<li><a href="#orgf8bd277">2.15. Symmetric vs Public Key</a></li>
<li><a href="#org94fe9d8">2.16. Message Authentication</a></li>
<li><a href="#org53f37c4">2.17. Hash Function Requirements</a></li>
<li><a href="#orgcdbcf32">2.18. Security of Hash Functions</a>
<ul>
<li><a href="#org79fb04f">2.18.1. Additional secure hash function applications:</a></li>
<li><a href="#org609f5db">2.18.2. Two approaches to attacking a secure hash function</a></li>
</ul>
</li>
<li><a href="#org0e32f57">2.19. Digital Signatures</a></li>
<li><a href="#org51eb583">2.20. Digital Envelopes</a></li>
<li><a href="#org10924ab">2.21. Random Numbers Uses</a></li>
<li><a href="#org843a033">2.22. Practical Application: Encryption of Stored Data</a></li>
</ul>
</li>
<li><a href="#org2bdbf12">3. Chapter 10: Buffer Overflow</a>
<ul>
<li><a href="#orgc553094">3.1. Buffer Overflow</a></li>
<li><a href="#org6a75b14">3.2. Buffer Overflow Basics</a></li>
<li><a href="#orgb031af1">3.3. Programs and Processes</a></li>
<li><a href="#orgc65c992">3.4. Buffer Overflow Attacks</a></li>
<li><a href="#org71ce36d">3.5. Programming Language History</a></li>
<li><a href="#orgff3b151">3.6. Stack Buffer Overflows</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc674d36" class="outline-2">
<h2 id="orgc674d36"><span class="section-number-2">1</span> Chapter 1: Overview</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4ff91f0" class="outline-3">
<h3 id="org4ff91f0"><span class="section-number-3">1.1</span> The CIA Triad</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Confidentiality
<ul class="org-ul">
<li>Preserving intended restrictions on information access</li>
</ul></li>
<li>Integrity
<ul class="org-ul">
<li>Guarding against improper information modification or destruction</li>
</ul></li>
<li>Availability
<ul class="org-ul">
<li>Ensuring timely and reliable access to information</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9036d79" class="outline-3">
<h3 id="org9036d79"><span class="section-number-3">1.2</span> Additional Security Concepts</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Authenticity</li>
<li>Accountability</li>
</ul>
</div>
</div>
<div id="outline-container-org4a59542" class="outline-3">
<h3 id="org4a59542"><span class="section-number-3">1.3</span> Challenges</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Only one vulnerability needs to be found by attacker,
defender must patch all vulnerabilities</li>
</ul>
</div>
</div>
<div id="outline-container-org88ed95b" class="outline-3">
<h3 id="org88ed95b"><span class="section-number-3">1.4</span> Categories of Vulnerabilities</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Corrupted (loss of integrity)</li>
<li>Leaky (loss of confidentiality)</li>
<li>Unavailable (loss of availability)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb4ea010" class="outline-3">
<h3 id="orgb4ea010"><span class="section-number-3">1.5</span> Categories of Attacks</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Passive
<ul class="org-ul">
<li>attempt to learn or make use of information from the system that does not affect system resources</li>
</ul></li>
<li>Active
<ul class="org-ul">
<li>attempt to alter system resources or affect their operation</li>
</ul></li>
<li>Insider
<ul class="org-ul">
<li>initiated by an entity within the security perimeter</li>
</ul></li>
<li>Outsider
<ul class="org-ul">
<li>initiated by an entity outside of the security perimeter</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge52769e" class="outline-3">
<h3 id="orge52769e"><span class="section-number-3">1.6</span> Security Functional Requirements</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Security technical measures
<ul class="org-ul">
<li>required to deal with access control problems</li>
<li>identification and authentication</li>
<li>system and communication protection</li>
<li>system and information integrity</li>
</ul></li>
<li>Management controls and procedures
<ul class="org-ul">
<li>awareness and training</li>
<li>audit and accountability</li>
<li>certification, acreditation and security assessments</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4f49ac6" class="outline-2">
<h2 id="org4f49ac6"><span class="section-number-2">2</span> Chapter 2: Cryptographic Tools</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6035dfc" class="outline-3">
<h3 id="org6035dfc"><span class="section-number-3">2.1</span> Cryptography vs. Security</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Theory vs Practice</li>
<li>Tools vs. Applications</li>
<li>etc</li>
</ul>
</div>
</div>
<div id="outline-container-org043d404" class="outline-3">
<h3 id="org043d404"><span class="section-number-3">2.2</span> Symmetric Encryption</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Also referred to as conventional encryption or single-key encryption</li>
</ul>
</div>
<div id="outline-container-orgfbe8e13" class="outline-4">
<h4 id="orgfbe8e13"><span class="section-number-4">2.2.1</span> Two requirements for secure use:</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>Strong encryption algorithm</li>
<li>Sender and receiver must have obtained copies of the secret key in a secure fashion</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org56531c2" class="outline-3">
<h3 id="org56531c2"><span class="section-number-3">2.3</span> Attacking Symmetric Encryption</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Broadly divided into cryptanalytic and brute-force attacks</li>
<li>Crypt analytic exploits weaknesses in the algorithm</li>
<li>A more critical possibility:
<ul class="org-ul">
<li>Stealing the keys from memory or disk</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6e441ff" class="outline-3">
<h3 id="org6e441ff"><span class="section-number-3">2.4</span> Table 2.1</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">DES</th>
<th scope="col" class="org-right">Triple DES</th>
<th scope="col" class="org-right">AES</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Plaintext block size (bits)</td>
<td class="org-right">64</td>
<td class="org-right">64</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">Ciphertext block size (bits)</td>
<td class="org-right">64</td>
<td class="org-right">64</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">Key size (bits)</td>
<td class="org-right">56</td>
<td class="org-right">112 or 168</td>
<td class="org-right">128, 192, or 256</td>
</tr>
</tbody>
</table>
</div>
</div>
