cs428.tex
% Created 2019-09-05 Thu 20:27
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{ethan}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={ethan},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2.5)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Chapter 1: Overview}
\label{sec:orga1c0d61}
\subsection{The CIA Triad}
\label{sec:orga81b7a9}
\begin{itemize}
\item Confidentiality
\begin{itemize}
\item Preserving intended restrictions on information access
\end{itemize}
\item Integrity
\begin{itemize}
\item Guarding against improper information modification or destruction
\end{itemize}
\item Availability
\begin{itemize}
\item Ensuring timely and reliable access to information
\end{itemize}
\end{itemize}
\subsection{Additional Security Concepts}
\label{sec:orgf8a303b}
\begin{itemize}
\item Authenticity
\item Accountability
\end{itemize}
\subsection{Challenges}
\label{sec:orgddb815a}
\begin{itemize}
\item Only one vulnerability needs to be found by attacker,
defender must patch all vulnerabilities
\end{itemize}
\subsection{Categories of Vulnerabilities}
\label{sec:org96f35cd}
\begin{itemize}
\item Corrupted (loss of integrity)
\item Leaky (loss of confidentiality)
\item Unavailable (loss of availability)
\end{itemize}
\subsection{Categories of Attacks}
\label{sec:orga6a9e71}
\begin{itemize}
\item Passive
\begin{itemize}
\item attempt to learn or make use of information from the system that does not affect system resources
\end{itemize}
\item Active
\begin{itemize}
\item attempt to alter system resources or affect their operation
\end{itemize}
\item Insider
\begin{itemize}
\item initiated by an entity within the security perimeter
\end{itemize}
\item Outsider
\begin{itemize}
\item initiated by an entity outside of the security perimeter
\end{itemize}
\end{itemize}
\subsection{Security Functional Requirements}
\label{sec:orgb87ceb6}
\begin{itemize}
\item Security technical measures
\begin{itemize}
\item required to deal with access control problems
\item identification and authentication
\item system and communication protection
\item system and information integrity
\end{itemize}
\item Management controls and procedures
\begin{itemize}
\item awareness and training
\item audit and accountability
\item certification, acreditation and security assessments
\end{itemize}
\end{itemize}
\section{Chapter 2: Cryptographic Tools}
\label{sec:orgbe22047}
\subsection{Cryptography vs. Security}
\label{sec:org6a5db6d}
\begin{itemize}
\item Theory vs Practice
\item Tools vs. Applications
\item etc
\end{itemize}
\subsection{Symmetric Encryption}
\label{sec:orgea1b2f8}
\begin{itemize}
\item Also referred to as conventional encryption or single-key encryption
\end{itemize}
\subsubsection{Two requirements for secure use:}
\label{sec:org80e0abc}
\begin{itemize}
\item Strong encryption algorithm
\item Sender and receiver must have obtained copies of the secret key in a secure fashion
\end{itemize}
\subsection{Attacking Symmetric Encryption}
\label{sec:org4504a48}
\begin{itemize}
\item Broadly divided into cryptanalytic and brute-force attacks
\item Crypt analytic exploits weaknesses in the algorithm
\item A more critical possibility:
\begin{itemize}
\item Stealing the keys from memory or disk
\end{itemize}
\end{itemize}
\subsection{Table 2.1}
\label{sec:orgd38a9af}
\begin{center}
\begin{tabular}{lrrr}
 & DES & Triple DES & AES\\
\hline
Plaintext block size (bits) & 64 & 64 & 128\\
Ciphertext block size (bits) & 64 & 64 & 128\\
Key size (bits) & 56 & 112 or 168 & 128, 192, or 256\\
\hline
\end{tabular}
\end{center}
