cs428.org
** Data Encryption Standard (DES)
- Most widely used encryption scheme
- Uses 64 bit plaintext block and 56 bit key to produce 64 bit ciphertext block
- Use of 56-bit key is strength concern:
  - EEF announced in July 1998 it had broken a DES encryption
- See diagram in slides
*** Triple DES (3DES)
- Repeat DES algorithm three times
- First standardized for use in finance in ANSI standard X9.17 in 1985
- Sluggish performance
** Advanced Encryption Standard (AES)
- NIST called for proposals for a new AES in 1997
- Selected Rijndael in November 2001
- See diagram in slides
** Practical Security Issues
- Typically encryption is applied to a unit  of data larger than e.g. a single 64-bit block
- Electronic codebook (ECB) mode is the simplest approach to multiple-block encryption
  - Each block is encrypted using the same key
  - Regularities in the plaintext may be exploitable
- Modes of operation
  - Alternative technique developed to increase security for symmetric block encryption of large sequences
  - Overcomes the weaknesses of ECB
** Block Ciphers
- Processes the input one block of elements at a time
- Produces separate output block for each input block
- Can reuse keys
- More common (than stream cipher?)
** Stream Ciphers
- Processes the input elements continuously
- Primary advantage is that this form of cipher is faster and uses less code
- Pseudorandom stream is one that is unpredictable without knowledge of the input key
** Public-Key Encryption Structure
- Asymmetric
  - Uses two separate keys
  - Public key and private key
  - Some form of protocol is needed for distribution
- See slides for diagram
- Each user has a public and private key
- Use intended receiver's public key to encrypt, They use their private key to decrypt
- Or the opposite
- e.g. PGP is Public Key Encryption
** RSA
- to encrypt a message M, the sender:
  - obtains public key of recipient: {e, n}
  - computes: C = M^e mod n where 0 <= M < n
- to decrypt the ciphertext C, the owner:
  - uses their private key: {d, n}
  - computes: M = C^d mod n
** Requirements for Public-Key Cryptosystems
- Computationally easy to:
  - create key pairs
  - encrypt message given public key
  - decrypt ciphertext knowing private key
- Computationally infeasible to:
  - recover original message without private key
  - determine private key from public key
- Also useful if either key can be used for either role
** Asymmetric Encryption Algorithms
- RSA (Rivest, Shamir, Adleman)
  - Developed in 1977
  - Most widely accepted and implemented approach to public-key encryption
  - Block cipher in which the plaintext and ciphertext are integers between 0 and n-1
- Diffie-Hellman key exchange
  - Enables two users to securely reach agreement about a shared secret that can be used as a secret key for subsequent symmetric encryption of messages
  - Limited to the exchange of keys
- Digital Signature Standard (DSS)
  - Provides only a digital signature function with SHA-1
  - Cannot be used for encryption or key exchange
- Elliptic Curve Cryptography (ECC)
  - Security like RSA, but with much smaller keys
** Table 2.3
| Algorithm      | Digital Signature | Symmetric Key Distribution | Encryption of Secret Keys |
|----------------+-------------------+----------------------------+---------------------------|
| RSA            | Yes               | Yes                        | Yes                       |
| Diffie-Hellman | No                | Yes                        | No                        |
| DSS            | Yes               | No                         | No                        |
| Elliptic Curve | Yes               | Yes                        | Yes                       |
** Symmetric vs Public Key
- Conventional Encryption
