cs428.html
<div id="outline-container-org7153eb2" class="outline-3">
<h3 id="org7153eb2"><span class="section-number-3">2.5</span> Data Encryption Standard (DES)</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Most widely used encryption scheme</li>
<li>Uses 64 bit plaintext block and 56 bit key to produce 64 bit ciphertext block</li>
<li>Use of 56-bit key is strength concern:
<ul class="org-ul">
<li>EEF announced in July 1998 it had broken a DES encryption</li>
</ul></li>
<li>See diagram in slides</li>
</ul>
</div>
<div id="outline-container-org20c9894" class="outline-4">
<h4 id="org20c9894"><span class="section-number-4">2.5.1</span> Triple DES (3DES)</h4>
<div class="outline-text-4" id="text-2-5-1">
<ul class="org-ul">
<li>Repeat DES algorithm three times</li>
<li>First standardized for use in finance in ANSI standard X9.17 in 1985</li>
<li>Sluggish performance</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org86abeff" class="outline-3">
<h3 id="org86abeff"><span class="section-number-3">2.6</span> Advanced Encryption Standard (AES)</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>NIST called for proposals for a new AES in 1997</li>
<li>Selected Rijndael in November 2001</li>
<li>See diagram in slides</li>
</ul>
</div>
</div>
<div id="outline-container-org17e744b" class="outline-3">
<h3 id="org17e744b"><span class="section-number-3">2.7</span> Practical Security Issues</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Typically encryption is applied to a unit  of data larger than e.g. a single 64-bit block</li>
<li>Electronic codebook (ECB) mode is the simplest approach to multiple-block encryption
<ul class="org-ul">
<li>Each block is encrypted using the same key</li>
<li>Regularities in the plaintext may be exploitable</li>
</ul></li>
<li>Modes of operation
<ul class="org-ul">
<li>Alternative technique developed to increase security for symmetric block encryption of large sequences</li>
<li>Overcomes the weaknesses of ECB</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org601f782" class="outline-3">
<h3 id="org601f782"><span class="section-number-3">2.8</span> Block Ciphers</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li>Processes the input one block of elements at a time</li>
<li>Produces separate output block for each input block</li>
<li>Can reuse keys</li>
<li>More common (than stream cipher?)</li>
</ul>
</div>
</div>
<div id="outline-container-orge24f206" class="outline-3">
<h3 id="orge24f206"><span class="section-number-3">2.9</span> Stream Ciphers</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>Processes the input elements continuously</li>
<li>Primary advantage is that this form of cipher is faster and uses less code</li>
<li>Pseudorandom stream is one that is unpredictable without knowledge of the input key</li>
</ul>
</div>
</div>
<div id="outline-container-orgcb8969f" class="outline-3">
<h3 id="orgcb8969f"><span class="section-number-3">2.10</span> Public-Key Encryption Structure</h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li>Asymmetric
<ul class="org-ul">
<li>Uses two separate keys</li>
<li>Public key and private key</li>
<li>Some form of protocol is needed for distribution</li>
</ul></li>
<li>See slides for diagram</li>
<li>Each user has a public and private key</li>
<li>Use intended receiver's public key to encrypt, They use their private key to decrypt</li>
<li>Or the opposite</li>
<li>e.g. PGP is Public Key Encryption</li>
</ul>
</div>
</div>
<div id="outline-container-org7207b5e" class="outline-3">
<h3 id="org7207b5e"><span class="section-number-3">2.11</span> RSA</h3>
<div class="outline-text-3" id="text-2-11">
<ul class="org-ul">
<li>to encrypt a message M, the sender:
<ul class="org-ul">
<li>obtains public key of recipient: {e, n}</li>
<li>computes: C = M<sup>e</sup> mod n where 0 &lt;= M &lt; n</li>
</ul></li>
<li>to decrypt the ciphertext C, the owner:
<ul class="org-ul">
<li>uses their private key: {d, n}</li>
<li>computes: M = C<sup>d</sup> mod n</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org63c0ff4" class="outline-3">
<h3 id="org63c0ff4"><span class="section-number-3">2.12</span> Requirements for Public-Key Cryptosystems</h3>
<div class="outline-text-3" id="text-2-12">
<ul class="org-ul">
<li>Computationally easy to:
<ul class="org-ul">
<li>create key pairs</li>
<li>encrypt message given public key</li>
<li>decrypt ciphertext knowing private key</li>
</ul></li>
<li>Computationally infeasible to:
<ul class="org-ul">
<li>recover original message without private key</li>
<li>determine private key from public key</li>
</ul></li>
<li>Also useful if either key can be used for either role</li>
</ul>
</div>
</div>
<div id="outline-container-orgc73e6ce" class="outline-3">
<h3 id="orgc73e6ce"><span class="section-number-3">2.13</span> Asymmetric Encryption Algorithms</h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li>RSA (Rivest, Shamir, Adleman)
<ul class="org-ul">
<li>Developed in 1977</li>
<li>Most widely accepted and implemented approach to public-key encryption</li>
<li>Block cipher in which the plaintext and ciphertext are integers between 0 and n-1</li>
</ul></li>
<li>Diffie-Hellman key exchange
<ul class="org-ul">
<li>Enables two users to securely reach agreement about a shared secret that can be used as a secret key for subsequent symmetric encryption of messages</li>
<li>Limited to the exchange of keys</li>
</ul></li>
<li>Digital Signature Standard (DSS)
<ul class="org-ul">
<li>Provides only a digital signature function with SHA-1</li>
<li>Cannot be used for encryption or key exchange</li>
</ul></li>
<li>Elliptic Curve Cryptography (ECC)
<ul class="org-ul">
<li>Security like RSA, but with much smaller keys</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org69f929e" class="outline-3">
<h3 id="org69f929e"><span class="section-number-3">2.14</span> Table 2.3</h3>
<div class="outline-text-3" id="text-2-14">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Algorithm</th>
<th scope="col" class="org-left">Digital Signature</th>
<th scope="col" class="org-left">Symmetric Key Distribution</th>
<th scope="col" class="org-left">Encryption of Secret Keys</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RSA</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Diffie-Hellman</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">DSS</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">Elliptic Curve</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf8bd277" class="outline-3">
<h3 id="orgf8bd277"><span class="section-number-3">2.15</span> Symmetric vs Public Key</h3>
<div class="outline-text-3" id="text-2-15">
<ul class="org-ul">
<li>Conventional Encryption</li>
</ul>
</div>
</div>
