cs428.tex
\subsection{Data Encryption Standard (DES)}
\label{sec:org1fa8f28}
\begin{itemize}
\item Most widely used encryption scheme
\item Uses 64 bit plaintext block and 56 bit key to produce 64 bit ciphertext block
\item Use of 56-bit key is strength concern:
\begin{itemize}
\item EEF announced in July 1998 it had broken a DES encryption
\end{itemize}
\item See diagram in slides
\end{itemize}
\subsubsection{Triple DES (3DES)}
\label{sec:orgb3d7d12}
\begin{itemize}
\item Repeat DES algorithm three times
\item First standardized for use in finance in ANSI standard X9.17 in 1985
\item Sluggish performance
\end{itemize}
\subsection{Advanced Encryption Standard (AES)}
\label{sec:org4ebd740}
\begin{itemize}
\item NIST called for proposals for a new AES in 1997
\item Selected Rijndael in November 2001
\item See diagram in slides
\end{itemize}
\subsection{Practical Security Issues}
\label{sec:orgb33ff6e}
\begin{itemize}
\item Typically encryption is applied to a unit  of data larger than e.g. a single 64-bit block
\item Electronic codebook (ECB) mode is the simplest approach to multiple-block encryption
\begin{itemize}
\item Each block is encrypted using the same key
\item Regularities in the plaintext may be exploitable
\end{itemize}
\item Modes of operation
\begin{itemize}
\item Alternative technique developed to increase security for symmetric block encryption of large sequences
\item Overcomes the weaknesses of ECB
\end{itemize}
\end{itemize}
\subsection{Block Ciphers}
\label{sec:org312c147}
\begin{itemize}
\item Processes the input one block of elements at a time
\item Produces separate output block for each input block
\item Can reuse keys
\item More common (than stream cipher?)
\end{itemize}
\subsection{Stream Ciphers}
\label{sec:orgb6951af}
\begin{itemize}
\item Processes the input elements continuously
\item Primary advantage is that this form of cipher is faster and uses less code
\item Pseudorandom stream is one that is unpredictable without knowledge of the input key
\end{itemize}
\subsection{Public-Key Encryption Structure}
\label{sec:orgb034db7}
\begin{itemize}
\item Asymmetric
\begin{itemize}
\item Uses two separate keys
\item Public key and private key
\item Some form of protocol is needed for distribution
\end{itemize}
\item See slides for diagram
\item Each user has a public and private key
\item Use intended receiver's public key to encrypt, They use their private key to decrypt
\item Or the opposite
\item e.g. PGP is Public Key Encryption
\end{itemize}
\subsection{RSA}
\label{sec:org199b041}
\begin{itemize}
\item to encrypt a message M, the sender:
\begin{itemize}
\item obtains public key of recipient: \{e, n\}
\item computes: C = M\textsuperscript{e} mod n where 0 <= M < n
\end{itemize}
\item to decrypt the ciphertext C, the owner:
\begin{itemize}
\item uses their private key: \{d, n\}
\item computes: M = C\textsuperscript{d} mod n
\end{itemize}
\end{itemize}
\subsection{Requirements for Public-Key Cryptosystems}
\label{sec:org344598f}
\begin{itemize}
\item Computationally easy to:
\begin{itemize}
\item create key pairs
\item encrypt message given public key
\item decrypt ciphertext knowing private key
\end{itemize}
\item Computationally infeasible to:
\begin{itemize}
\item recover original message without private key
\item determine private key from public key
\end{itemize}
\item Also useful if either key can be used for either role
\end{itemize}
\subsection{Asymmetric Encryption Algorithms}
\label{sec:orgf411ed8}
\begin{itemize}
\item RSA (Rivest, Shamir, Adleman)
\begin{itemize}
\item Developed in 1977
\item Most widely accepted and implemented approach to public-key encryption
\item Block cipher in which the plaintext and ciphertext are integers between 0 and n-1
\end{itemize}
\item Diffie-Hellman key exchange
\begin{itemize}
\item Enables two users to securely reach agreement about a shared secret that can be used as a secret key for subsequent symmetric encryption of messages
\item Limited to the exchange of keys
\end{itemize}
\item Digital Signature Standard (DSS)
\begin{itemize}
\item Provides only a digital signature function with SHA-1
\item Cannot be used for encryption or key exchange
\end{itemize}
\item Elliptic Curve Cryptography (ECC)
\begin{itemize}
\item Security like RSA, but with much smaller keys
\end{itemize}
\end{itemize}
\subsection{Table 2.3}
\label{sec:orge77a887}
\begin{center}
\begin{tabular}{llll}
Algorithm & Digital Signature & Symmetric Key Distribution & Encryption of Secret Keys\\
\hline
RSA & Yes & Yes & Yes\\
Diffie-Hellman & No & Yes & No\\
DSS & Yes & No & No\\
Elliptic Curve & Yes & Yes & Yes\\
\end{tabular}
\end{center}
\subsection{Symmetric vs Public Key}
\label{sec:org26d4948}
\begin{itemize}
\item Conventional Encryption
\end{itemize}
