cs428.org
** Message Authentication
** Hash Function Requirements
- Can be applied to any size block of data
- Produces a fixed-length output
- Relatively easy to compute for any input
- One way or pre-image resistant (not reversible to get input)
- Second pre-image resistant or weak collision resistant
  - Computationally infeasible to find input which will hash to the same value as given input
- Collision resistant or strong collision resistance
  - Computationally infeasible to find any pair of inputs that will hash to the same value
Note the distinction between weak collision resistant and strong collision resistant 
** Security of Hash Functions
- SHA most widely used hash algorithm
*** Additional secure hash function applications:
- Password
  - Hash of a password is stored rather than password itself
- Intrusion detection
  - Store H(F) for each file on a system and secure the hash values
  - Now possible to detect manipulation by recomputing hash values
*** Two approaches to attacking a secure hash function
- Cryptanalysis
- Brute-force
** Digital Signatures
- Think PGP
** Digital Envelopes
- Rather than using public key to encrypt message, encrypt a symmetric key using public key, and send message encrypted with this symmetric key
- This is useful as symmetric key encryption is quicker
** Random Numbers Uses
- Keys for public-key algorithms
- Stream key for symmetric stream cipher
- Symmetric key for use in e.g. creating a digital envelope
- Handshaking to prevent replay attack
- Session key
** Practical Application: Encryption of Stored Data
- Common to encrypt transmitted data
- Much less common to encrypt stored data
* Chapter 10: Buffer Overflow
** Buffer Overflow
- A very common attack mechanism
- Known prevention techniques
- A buffer overflow, also known as buffer overrun defined:
  - A condition at an interface under which more input can be placed into a buffer than the capacity allocated, overwriting other information. Exploited to crash a system, or insert carefully crafted code to gain control of the system.
** Buffer Overflow Basics
- A process attempts to store data beyond the limits of a fixed-sized buffer
- Overwrites adjacent memory locations
- Buffer could be located on the stack, in the heap, or in the data section of the process
** Programs and Processes
| Kernel Code and Data  |
| Stack                 |
| Spare Memory          |
| Heap                  |
| Global Data           |
| Program Machine Code  |
| Process Control Block |
** Buffer Overflow Attacks
- The exploit a buffer overflow an attacker needs:
  - To identify a buffer overflow vulnerability in some program that can be triggered using data under the attacker's control
  - To understand how that buffer is stored in memory and determine potential for corruption
- Identifying vulnerable programs can be done by:
  - Inspection of program source
  - Tracing the execution of programs as they process over-sized input
  - Using tools such as fuzzing to automatically identify potential vulnerabilities
** Programming Language History
- At the machine level, data manipulated by machine instructions much be stored in either the processor's registers or in memory
- Assembly language program is responsible for the correct interpretation of any saved data value
