cs428.html
<div id="outline-container-org94fe9d8" class="outline-3">
<h3 id="org94fe9d8"><span class="section-number-3">2.16</span> Message Authentication</h3>
</div>
<div id="outline-container-org53f37c4" class="outline-3">
<h3 id="org53f37c4"><span class="section-number-3">2.17</span> Hash Function Requirements</h3>
<div class="outline-text-3" id="text-2-17">
<ul class="org-ul">
<li>Can be applied to any size block of data</li>
<li>Produces a fixed-length output</li>
<li>Relatively easy to compute for any input</li>
<li>One way or pre-image resistant (not reversible to get input)</li>
<li>Second pre-image resistant or weak collision resistant
<ul class="org-ul">
<li>Computationally infeasible to find input which will hash to the same value as given input</li>
</ul></li>
<li>Collision resistant or strong collision resistance
<ul class="org-ul">
<li>Computationally infeasible to find any pair of inputs that will hash to the same value</li>
</ul></li>
</ul>
<p>
Note the distinction between weak collision resistant and strong collision resistant 
</p>
</div>
</div>
<div id="outline-container-orgcdbcf32" class="outline-3">
<h3 id="orgcdbcf32"><span class="section-number-3">2.18</span> Security of Hash Functions</h3>
<div class="outline-text-3" id="text-2-18">
<ul class="org-ul">
<li>SHA most widely used hash algorithm</li>
</ul>
</div>
<div id="outline-container-org79fb04f" class="outline-4">
<h4 id="org79fb04f"><span class="section-number-4">2.18.1</span> Additional secure hash function applications:</h4>
<div class="outline-text-4" id="text-2-18-1">
<ul class="org-ul">
<li>Password
<ul class="org-ul">
<li>Hash of a password is stored rather than password itself</li>
</ul></li>
<li>Intrusion detection
<ul class="org-ul">
<li>Store H(F) for each file on a system and secure the hash values</li>
<li>Now possible to detect manipulation by recomputing hash values</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org609f5db" class="outline-4">
<h4 id="org609f5db"><span class="section-number-4">2.18.2</span> Two approaches to attacking a secure hash function</h4>
<div class="outline-text-4" id="text-2-18-2">
<ul class="org-ul">
<li>Cryptanalysis</li>
<li>Brute-force</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0e32f57" class="outline-3">
<h3 id="org0e32f57"><span class="section-number-3">2.19</span> Digital Signatures</h3>
<div class="outline-text-3" id="text-2-19">
<ul class="org-ul">
<li>Think PGP</li>
</ul>
</div>
</div>
<div id="outline-container-org51eb583" class="outline-3">
<h3 id="org51eb583"><span class="section-number-3">2.20</span> Digital Envelopes</h3>
<div class="outline-text-3" id="text-2-20">
<ul class="org-ul">
<li>Rather than using public key to encrypt message, encrypt a symmetric key using public key, and send message encrypted with this symmetric key</li>
<li>This is useful as symmetric key encryption is quicker</li>
</ul>
</div>
</div>
<div id="outline-container-org10924ab" class="outline-3">
<h3 id="org10924ab"><span class="section-number-3">2.21</span> Random Numbers Uses</h3>
<div class="outline-text-3" id="text-2-21">
<ul class="org-ul">
<li>Keys for public-key algorithms</li>
<li>Stream key for symmetric stream cipher</li>
<li>Symmetric key for use in e.g. creating a digital envelope</li>
<li>Handshaking to prevent replay attack</li>
<li>Session key</li>
</ul>
</div>
</div>
<div id="outline-container-org843a033" class="outline-3">
<h3 id="org843a033"><span class="section-number-3">2.22</span> Practical Application: Encryption of Stored Data</h3>
<div class="outline-text-3" id="text-2-22">
<ul class="org-ul">
<li>Common to encrypt transmitted data</li>
<li>Much less common to encrypt stored data</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2bdbf12" class="outline-2">
<h2 id="org2bdbf12"><span class="section-number-2">3</span> Chapter 10: Buffer Overflow</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc553094" class="outline-3">
<h3 id="orgc553094"><span class="section-number-3">3.1</span> Buffer Overflow</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>A very common attack mechanism</li>
<li>Known prevention techniques</li>
<li>A buffer overflow, also known as buffer overrun defined:
<ul class="org-ul">
<li>A condition at an interface under which more input can be placed into a buffer than the capacity allocated, overwriting other information. Exploited to crash a system, or insert carefully crafted code to gain control of the system.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6a75b14" class="outline-3">
<h3 id="org6a75b14"><span class="section-number-3">3.2</span> Buffer Overflow Basics</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>A process attempts to store data beyond the limits of a fixed-sized buffer</li>
<li>Overwrites adjacent memory locations</li>
<li>Buffer could be located on the stack, in the heap, or in the data section of the process</li>
</ul>
</div>
</div>
<div id="outline-container-orgb031af1" class="outline-3">
<h3 id="orgb031af1"><span class="section-number-3">3.3</span> Programs and Processes</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Top of memory</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Kernel Code and Data</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Stack</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Spare Memory</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Heap</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Global Data</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Program Machine Code</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Process Control Block</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Bottom of memory</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc65c992" class="outline-3">
<h3 id="orgc65c992"><span class="section-number-3">3.4</span> Buffer Overflow Attacks</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>The exploit a buffer overflow an attacker needs:
<ul class="org-ul">
<li>To identify a buffer overflow vulnerability in some program that can be triggered using data under the attacker's control</li>
<li>To understand how that buffer is stored in memory and determine potential for corruption</li>
</ul></li>
<li>Identifying vulnerable programs can be done by:
<ul class="org-ul">
<li>Inspection of program source</li>
<li>Tracing the execution of programs as they process over-sized input</li>
<li>Using tools such as fuzzing to automatically identify potential vulnerabilities</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org71ce36d" class="outline-3">
<h3 id="org71ce36d"><span class="section-number-3">3.5</span> Programming Language History</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>At the machine level, data manipulated by machine instructions much be stored in either the processor's registers or in memory</li>
<li>Assembly language program is responsible for the correct interpretation of any saved data value</li>
</ul>
</div>
</div>
