cs428.tex
\subsection{Message Authentication}
\label{sec:org6379134}
\subsection{Hash Function Requirements}
\label{sec:orgce7c9e0}
\begin{itemize}
\item Can be applied to any size block of data
\item Produces a fixed-length output
\item Relatively easy to compute for any input
\item One way or pre-image resistant (not reversible to get input)
\item Second pre-image resistant or weak collision resistant
\begin{itemize}
\item Computationally infeasible to find input which will hash to the same value as given input
\end{itemize}
\item Collision resistant or strong collision resistance
\begin{itemize}
\item Computationally infeasible to find any pair of inputs that will hash to the same value
\end{itemize}
\end{itemize}
Note the distinction between weak collision resistant and strong collision resistant 
\subsection{Security of Hash Functions}
\label{sec:org8272a83}
\begin{itemize}
\item SHA most widely used hash algorithm
\end{itemize}
\subsubsection{Additional secure hash function applications:}
\label{sec:orge0f7048}
\begin{itemize}
\item Password
\begin{itemize}
\item Hash of a password is stored rather than password itself
\end{itemize}
\item Intrusion detection
\begin{itemize}
\item Store H(F) for each file on a system and secure the hash values
\item Now possible to detect manipulation by recomputing hash values
\end{itemize}
\end{itemize}
\subsubsection{Two approaches to attacking a secure hash function}
\label{sec:orgf9b79f1}
\begin{itemize}
\item Cryptanalysis
\item Brute-force
\end{itemize}
\subsection{Digital Signatures}
\label{sec:orgc65b0e8}
\begin{itemize}
\item Think PGP
\end{itemize}
\subsection{Digital Envelopes}
\label{sec:org793618c}
\begin{itemize}
\item Rather than using public key to encrypt message, encrypt a symmetric key using public key, and send message encrypted with this symmetric key
\item This is useful as symmetric key encryption is quicker
\end{itemize}
\subsection{Random Numbers Uses}
\label{sec:orga1923fe}
\begin{itemize}
\item Keys for public-key algorithms
\item Stream key for symmetric stream cipher
\item Symmetric key for use in e.g. creating a digital envelope
\item Handshaking to prevent replay attack
\item Session key
\end{itemize}
\subsection{Practical Application: Encryption of Stored Data}
\label{sec:org98bdd74}
\begin{itemize}
\item Common to encrypt transmitted data
\item Much less common to encrypt stored data
\end{itemize}
\section{Chapter 10: Buffer Overflow}
\label{sec:orgee092af}
\subsection{Buffer Overflow}
\label{sec:org0c418cb}
\begin{itemize}
\item A very common attack mechanism
\item Known prevention techniques
\item A buffer overflow, also known as buffer overrun defined:
\begin{itemize}
\item A condition at an interface under which more input can be placed into a buffer than the capacity allocated, overwriting other information. Exploited to crash a system, or insert carefully crafted code to gain control of the system.
\end{itemize}
\end{itemize}
\subsection{Buffer Overflow Basics}
\label{sec:org2629f9c}
\begin{itemize}
\item A process attempts to store data beyond the limits of a fixed-sized buffer
\item Overwrites adjacent memory locations
\item Buffer could be located on the stack, in the heap, or in the data section of the process
\end{itemize}
\subsection{Programs and Processes}
\label{sec:org309c5d3}
\begin{center}
\begin{tabular}{l}
Kernel Code and Data\\
Stack\\
Spare Memory\\
Heap\\
Global Data\\
Program Machine Code\\
Process Control Block\\
\end{tabular}
\end{center}
\subsection{Buffer Overflow Attacks}
\label{sec:org14872e3}
\begin{itemize}
\item The exploit a buffer overflow an attacker needs:
\begin{itemize}
\item To identify a buffer overflow vulnerability in some program that can be triggered using data under the attacker's control
\item To understand how that buffer is stored in memory and determine potential for corruption
\end{itemize}
\item Identifying vulnerable programs can be done by:
\begin{itemize}
\item Inspection of program source
\item Tracing the execution of programs as they process over-sized input
\item Using tools such as fuzzing to automatically identify potential vulnerabilities
\end{itemize}
\end{itemize}
\subsection{Programming Language History}
\label{sec:orga46b67a}
\begin{itemize}
\item At the machine level, data manipulated by machine instructions much be stored in either the processor's registers or in memory
\item Assembly language program is responsible for the correct interpretation of any saved data value
\end{itemize}
