cs428.org
** Stack Buffer Overflows 
- Occur when overflown buffer is located on stack
  - Also referred to as stack smashing
- Still being widely exploited
- Stack frame
  - Stores return address when one function calls another function
  - Also needs location to save passed parameters and possible save register values
