cs428.html
<div id="outline-container-orgff3b151" class="outline-3">
<h3 id="orgff3b151"><span class="section-number-3">3.6</span> Stack Buffer Overflows</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>Occur when overflown buffer is located on stack
<ul class="org-ul">
<li>Also referred to as stack smashing</li>
</ul></li>
<li>Still being widely exploited</li>
<li>Stack frame
<ul class="org-ul">
<li>Stores return address when one function calls another function</li>
<li>Also needs location to save passed parameters and possible save register values</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ethan</p>
<p class="date">Created: 2019-09-05 Thu 20:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
