cs428.tex
\subsection{Stack Buffer Overflows}
\label{sec:orgff628e7}
\begin{itemize}
\item Occur when overflown buffer is located on stack
\begin{itemize}
\item Also referred to as stack smashing
\end{itemize}
\item Still being widely exploited
\item Stack frame
\begin{itemize}
\item Stores return address when one function calls another function
\item Also needs location to save passed parameters and possible save register values
\end{itemize}
\end{itemize}
\end{document}
